import streamlit as st

st.header("jasser to aya ")
def beautiful_style_box(text):
    return f'<div style="background-color: #f9f9f9; border: 1px solid #e6e6e6; padding: 20px; border-radius: 10px; color: black;">{text}</div>'

message = '''
عزيزتي آية،

أود أن أعبر لك عن أعمق اعتذاري وندمي الشديدين على ما حدث بيننا مؤخرًا. لقد أدركت أن سلوكي كان غير لائق وغير مقبول تجاهك، وأشعر بالأسف الشديد لأنني قد أساءت لك بأي شكل من الأشكال.

في الحقيقة، لا يمكنني العثور على كلمات مناسبة لوصف مدى ندمي على تصرفاتي الخاطئة. كانت تلك اللحظات تمثل أحد أكبر الأخطاء التي ارتكبتها، وأعلم أنها قد ألحقت أذى وألمًا بك.

آية، أتمنى أن تفهمي أنني لم أقصد إيذائك أو إحداث الضرر لمشاعرك بأي شكل من الأشكال. كنت في حالة عصبية وفقدت توازني وقامت مشاعري بالسيطرة على تفكيري وتصرفاتي. لكن هذا لا يعتبر تبريرًا لسلوكي السيء، بل إنه يزيد من عمق الندم الذي أشعر به.

أعلم أن الكلمات وحدها لا يمكنها تصحيح الأخطاء التي ارتكبتها، لكن أود أن تعلمي أنني ملتزم بالتغيير والنمو الشخصي. سأعمل بجد على تصحيح سلوكي والعمل على تحسين نفسي. سأتعلم من هذا الخطأ ولن يتكرر مرة أخرى.

آمل أن تتقبلي اعتذاري بصدر رحب وتمنحيني فرصة لإثبات أنني يمكنني التغيير. أنت تعني الكثير بالنسبة لي، وأرغب في استعادة ثقتك واحترامك.

شكرًا لك على قراءة هذه الرسالة، وآمل أن تسامحيني. أتطلع إلى فرصة للتواصل معك والعمل على بناء علاقتنا مرة أخرى.
'''

formatted_message = beautiful_style_box(message)

st.markdown(formatted_message, unsafe_allow_html=True)
st.write("")
st.write("Sory :pensive: , My love :heartbeat:")